vwb/app/views/home/index.html.erb

SELECT "edithomepages".* FROM "edithomepages"
---

          <% Edithomepage.all.each_with_index  do |edithomepage, i| %>