vwb/app/models/userlogin.rb

INSERT INTO "userlogins" ("email", "full_name", "uid", "avatar_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "userlogins".* FROM "userlogins" WHERE "userlogins"."email" = $1 LIMIT $2  [["email", "entao2000@gmail.com"], ["LIMIT", 1]]
---
    def self.from_google(email:, full_name:, uid:, avatar_url:)
      return nil unless email =~ /@gmail.com || @tamu.edu\z/
      create_with(uid: uid, full_name: full_name, avatar_url: avatar_url).find_or_create_by!(email: email)