vwb/app/controllers/userlogins/omniauth_callbacks_controller.rb

SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "entao@tamu.edu"], ["LIMIT", 1]]
---
    def after_sign_in_path_for(resource_or_scope)
      #stored_location_for(resource_or_scope) || root_path
      if User.exists?(email: current_userlogin.email)