vwb/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "entao@tamu.edu"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "entao2000@gmail.com"], ["LIMIT", 1]]
---
  def admin_verify
    authenticate_userlogin!
    if !User.exists?(email: current_userlogin.email)