vwb/app/controllers/event_controller.rb

  def index
    @auth = User.find_by(email: current_userlogin.email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "entao2000@gmail.com"], ["LIMIT", 1]]

  def new
    @auth = User.find_by(email: current_userlogin.email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "entao2000@gmail.com"], ["LIMIT", 1]]