vwb/app/controllers/event_controller.rb

	def index
		@events = Event.all
		@pointEvents = PointEvent.all
---
SELECT "events".* FROM "events"
SELECT "point_events".* FROM "point_events"

	def create
		@event = Event.new(eventParams)

		if @event.save
---
INSERT INTO "events" ("name", "description", "startDate", "endDate", "points", "eventType", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def update
		@event = Event.find(params[:id])

		if @event.update(eventParams)
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "description" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["description", "Weekly Meeting 2"], ["updated_at", "2021-02-14 00:28:53.457242"], ["id", 1]]

	def delete
		@event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]