vwb/app/controllers/point_event_controller.rb

	def index
		@pointEvents = PointEvent.all
---
SELECT "point_events".* FROM "point_events"

	def show
		@pointEvent = PointEvent.find(params[:id])
---
SELECT "point_events".* FROM "point_events" WHERE "point_events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@pointEvent = PointEvent.new(pointEventParams)

		#if true
		if @pointEvent.save
---
INSERT INTO "point_events" ("name", "description", "points", "eventType", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Tikes"], ["description", "rawe"], ["points", 312], ["eventType", "41"], ["created_at", "2021-02-14 01:26:34.342333"], ["updated_at", "2021-02-14 01:26:34.342333"]]

	def edit
		@pointEvent = PointEvent.find(params[:id])
---
SELECT "point_events".* FROM "point_events" WHERE "point_events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def update
		@pointEvent = PointEvent.find(params[:id])

		#if true
		if @pointEvent.update(pointEventParams)
---
SELECT "point_events".* FROM "point_events" WHERE "point_events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "point_events" SET "eventType" = $1, "updated_at" = $2 WHERE "point_events"."id" = $3  [["eventType", "412"], ["updated_at", "2021-02-14 01:27:39.311645"], ["id", 1]]

	def delete
		@pointEvent = PointEvent.find(params[:id])
---
SELECT "point_events".* FROM "point_events" WHERE "point_events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def destroy
		@pointEvent = PointEvent.find(params[:id])
		@pointEvent.destroy
---
SELECT "point_events".* FROM "point_events" WHERE "point_events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "point_events" WHERE "point_events"."id" = $1  [["id", 1]]