vwb/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."approved" = $1  [["approved", true]]
---
  def index
    @users= User.where(approved: true)

INSERT INTO "users" ("email", "classification", "tShirtSize", "approved", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "entao@tamu.edu"], ["classification", "Freshman"], ["tShirtSize", "XXS"], ["approved", true], ["created_at", "2021-03-11 04:08:42.448035"], ["updated_at", "2021-03-11 04:08:42.448035"]]
SELECT "users".* FROM "users" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]
---
  def create
    @user = User.new(user_params)

    if @user.save
      redirect_to @user
    else
      if @user.valid?
        @msg="New user: "+@user.firstName+" "+@user.lastName+" created"

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "classification" = $1, "tShirtSize" = $2, "participationPoints" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["classification", "Freshman"], ["tShirtSize", "XXS"], ["participationPoints", 15], ["updated_at", "2021-03-22 06:50:30.979156"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def destroy
    @user = User.find(params[:id])
    tmp = @user
    @user.destroy

    redirect_to users_path, notice:"Succesfully deleted user: "+@user.firstName+" "+@user.lastName+"."

SELECT "users".* FROM "users" WHERE "users"."approved" = $1  [["approved", false]]
---
  def pendingApproval
    @users = User.where(approved: false)