vwb/app/controllers/users_controller.rb

  def index
    @auth = User.find_by(email: current_userlogin.email)
    if !@auth
      redirect_to new_user_path
      return
    elsif @auth.role.zero? || @auth.approved == false
      redirect_to memberDashboard_path
      return
    end

    @order = params[:order] == 'true'
    @attr = params[:attr]
    @attr ||= 'first'
    ord = 'ASC'
    ord = if @order == true
            'ASC'
          else
            'DESC'
          end
    @users = case @attr
             when 'first'
               User.where(approved: true).order("\"users\".\"firstName\" #{ord}")
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "entao2000@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."approved" = $1 ORDER BY "users"."firstName" DESC  [["approved", true]]

             else
               User.where(approved: true).order('"users"."lastName" ASC')
             end
    @latestNew = User.order('created_at').last
    @latestUpdate = User.order('updated_at').last
---
SELECT "users".* FROM "users" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY updated_at DESC LIMIT $1  [["LIMIT", 1]]

  def show
    @msg = params[:notice]
    @auth = User.find_by(email: current_userlogin.email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "entao@tamu.edu"], ["LIMIT", 1]]

  def new
    @auth = User.find_by(email: current_userlogin.email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "entao2000@gmail.com"], ["LIMIT", 1]]

  def destroy
    @auth = User.find_by(email: current_userlogin.email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "entao2000@gmail.com"], ["LIMIT", 1]]

  def pendingApproval
    @auth = User.find_by(email: current_userlogin.email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "entao2000@gmail.com"], ["LIMIT", 1]]